# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def divide(a, b):
    if b == 0:
        return 'На ноль делить нельзя!'

    if b != 0:
        return a/b

a = float(input('Введите делимое: '))
b = float(input('Введите делитель: '))

print(divide(a,b))