# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

x = float(input('Введите действительное положительное число: '))
y = int(input('Введите целое отрицательное число: '))

def my_func(x, y):
    result = 0
    value = x

    for i in range(1, abs(y)):
        value *= x

    result = 1/value
    print(x, ' в степени ', y, ' = ', result)

my_func(float(x), int(y))

print('Проверка: ', float(x)**float(y))