# 2. Реализовать функцию, принимающую несколько параметров,
# описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

name = input('Введите имя: ')
surname = input('Введите фамилию: ')
city = input('Введите город проживания: ')
email = input('Введите email: ')
phone = input('Введите телефон: ')

print(name, surname, city, email, phone)

def print_user_data(name, surname, city, email, phone):
    print(f' Имя: {name}; фамилия: {surname}; город проживания: {city}; email: {email}; телефон: {phone}')


